In [3]:
import sqlite3

db = sqlite3.connect("IMDB.sqlite")
db

In [4]:
import sqlite3

db = sqlite3.connect("IMD.sqlite") # file not exist
# if file not exist, it creates a file and establishes the connection
db

In [5]:
# create a cursor object, to to database queries
db = sqlite3.connect("School.sqlite")

In [6]:
# connection object . cursor

cur = db.cursor()
sql_query = "create table Student(RNo int Primary key, Name Text, Age int)"
cur.execute(sql_query)

In [7]:
cur.execute('insert into Student values (101,"Ismail",20), (102,"Abilash",23)')

In [8]:
db.commit() #we should commit our tranaction to reflect in our database

In [9]:
cur.execute('insert into Student values (101,"Ismail",20)')

IntegrityError: UNIQUE constraint failed: Student.RNo

In [10]:
db.close()

In [11]:
cur.execute('insert into Student values (101,"Ismail",20)')

ProgrammingError: Cannot operate on a closed database.

In [12]:
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()
cur.execute("create table EmployeeDetail (employeeId int primary key, name Text , age int, department Text, salary int)")
cur.execute('insert into EmployeeDetail values (100,"Rishav",25,"Marketing",50000),(101,"Abhishek",26,"Operations",60000),(102,"Aman",28,"Human Resources",75000)')
db.commit()

In [13]:
db.close()

## Passing Parameters in query

In [4]:
import sqlite3
db = sqlite3.connect('School.sqlite')
db

In [5]:
cur = db.cursor()
cur

In [6]:
cur.execute("insert into Student values(103,'Luthu',24)")

In [7]:
db.commit()

In [9]:
rollNumber = 104

Name = "Manaikanta"
age = 34

cur.execute("insert into Student values (?,?,?)",(rollNumber,Name,age))
db.commit()

## for adding multiple values at a time

In [11]:
values = [(105,"Rahul",25),(106,"Tarun",26),(107,"Karthik",27),(108,"Shirfan",28)]

cur.executemany('Insert into Student values (?,?,?)',values)

In [12]:
db.commit()

## update , delete value

In [16]:
cur.execute('Update Student set Age ="22"')

In [17]:
db.commit()

In [19]:
cur.execute('Update Student set Age ="40" where Rno = 106')

In [20]:
db.commit()

In [22]:
rollNumber = 105

cur.execute('Update Student set Age ="30" where Rno = ?',(rollNumber,))

In [23]:
db.commit()

In [24]:
rollNumber = 107
cur.execute('delete from Student where Rno = ?',(rollNumber,))

In [25]:
db.commit()

## Extract the data from sqlite

In [27]:
cur.execute("Select * from Student")
for row in cur:
    print(row)

(101, 'Ismail', 22)
(102, 'Abilash', 22)
(103, 'Luthu', 22)
(104, 'Manaikanta', 22)
(105, 'Rahul', 30)
(106, 'Tarun', 40)
(108, 'Shirfan', 22)

In [28]:
# fetch one()
# fetch many()
# fetch all()

In [38]:
cur.execute("Select * from Student")
print(cur.fetchone())
print(cur.fetchone())

(101, 'Ismail', 22)
(102, 'Abilash', 22)

In [39]:
cur.fetchone()

(103, 'Luthu', 22)

In [41]:
cur.fetchmany(3)

[(105, 'Rahul', 30), (106, 'Tarun', 40), (108, 'Shirfan', 22)]

In [43]:
cur.execute("Select * from Student")
print(cur.fetchmany(3))

[(101, 'Ismail', 22), (102, 'Abilash', 22), (103, 'Luthu', 22)]

In [44]:
cur.execute("Select * from Student")
print(cur.fetchall())

[(101, 'Ismail', 22), (102, 'Abilash', 22), (103, 'Luthu', 22), (104, 'Manaikanta', 22), (105, 'Rahul', 30), (106, 'Tarun', 40), (108, 'Shirfan', 22)]

In [47]:
cur.execute("Select * from Student")
list_of_rows=cur.fetchall()
for row in list_of_rows:
    print(row)

(101, 'Ismail', 22)
(102, 'Abilash', 22)
(103, 'Luthu', 22)
(104, 'Manaikanta', 22)
(105, 'Rahul', 30)
(106, 'Tarun', 40)
(108, 'Shirfan', 22)

In [48]:
cur.execute("Select * from Student where rno>103")
list_of_rows=cur.fetchall()
for row in list_of_rows:
    print(row)

(104, 'Manaikanta', 22)
(105, 'Rahul', 30)
(106, 'Tarun', 40)
(108, 'Shirfan', 22)

In [51]:
cur.execute("Select * from Student where name like 'I%' ")
list_of_rows=cur.fetchall()
for row in list_of_rows:
    print(row)

(101, 'Ismail', 22)

In [57]:
# Finance Employee SQLite

db = sqlite3.connect("Employee.sqlite")
cur = db.cursor()

cur.execute("select employeeid,name from EmployeeDetail where department ='Finance'")
list_of_employee = cur.fetchall()

for employee in list_of_employee:
    print(employee)

(103, 'Siddharth')
(107, 'Vaibhav')

In [53]:
db.commit()

In [59]:
# Find Employee

db = sqlite3.connect("Employee.sqlite")
cur = db.cursor()

cur.execute("select department, count(department) from EmployeeDetail group by department")
list_of_employee = cur.fetchall()

for employee in list_of_employee:
    print(employee)

('Finance', 2)
('Human Resource', 2)
('IT', 2)
('Marketing', 4)
('Operations', 2)

In [60]:
# working with sql with pandas

In [62]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')

read_sql_query(query, connection_object)

In [70]:
data = pd.read_sql_query("Select * from student",db)

In [74]:
print(data)
print(type(data))

   RNo        Name  Age
0  101      Ismail   22
1  102     Abilash   22
2  103       Luthu   22
3  104  Manaikanta   22
4  105       Rahul   30
5  106       Tarun   40
6  108     Shirfan   22
<class 'pandas.core.frame.DataFrame'>

In [68]:
# By using pandas it is very rather than using connect, cursor, fetch

In [75]:
data[data['Age']==22]

   RNo        Name  Age
0  101      Ismail   22
1  102     Abilash   22
2  103       Luthu   22
3  104  Manaikanta   22
6  108     Shirfan   22

In [76]:
# creating a table in pandas

In [79]:
data = pd.DataFrame([[201,"Aman","English",2000], 
                     [202,"Amrutha","Hindi",2001],
                     [203,"Abyutha","Sanskrit",2005],
                     [206,"Suresh","Maths",2009]],
                    columns=["ID","Name","Courses","Salary"])

In [80]:
data

    ID     Name   Courses  Salary
0  201     Aman   English    2000
1  202  Amrutha     Hindi    2001
2  203  Abyutha  Sanskrit    2005
3  206   Suresh     Maths    2009

In [82]:
data.to_sql("Faculty",db)

4

In [83]:
data = pd.read_sql_query("Select * from student",db)
data

   RNo        Name  Age
0  101      Ismail   22
1  102     Abilash   22
2  103       Luthu   22
3  104  Manaikanta   22
4  105       Rahul   30
5  106       Tarun   40
6  108     Shirfan   22

In [84]:
data["Address"] ="Test"

In [85]:
data

   RNo        Name  Age Address
0  101      Ismail   22    Test
1  102     Abilash   22    Test
2  103       Luthu   22    Test
3  104  Manaikanta   22    Test
4  105       Rahul   30    Test
5  106       Tarun   40    Test
6  108     Shirfan   22    Test

In [86]:
data.to_sql("Student",db,if_exists = "replace")

7

In [87]:
data

   RNo        Name  Age Address
0  101      Ismail   22    Test
1  102     Abilash   22    Test
2  103       Luthu   22    Test
3  104  Manaikanta   22    Test
4  105       Rahul   30    Test
5  106       Tarun   40    Test
6  108     Shirfan   22    Test

In [89]:
db = sqlite3.connect("IMDB.sqlite")

In [94]:
import pandas as pd
import sqlite3

query = """
SELECT genre, COUNT(genre) AS genre_count
FROM IMDB
JOIN genre ON IMDB.movie_id = genre.movie_id
GROUP BY genre
"""

data = pd.read_sql_query(query, db)

In [95]:
data

        genre  genre_count
0                       41
1      Action           33
2   Adventure           43
3   Animation           13
4   Biography           21
5      Comedy           31
6       Crime           11
7       Drama           77
8      Family            3
9     Fantasy            7
10    History            6
11     Horror            2
12      Music            3
13    Musical            1
14    Mystery            7
15    Romance           13
16     Sci-Fi           18
17      Sport            3
18   Thriller           14
19        War            2
20    Western            2

In [99]:
import pandas as pd
import sqlite3

# Assuming you have a SQLite database connection named 'db'
query = """
SELECT IMDB.rating
FROM IMDB
JOIN genre ON IMDB.movie_id = genre.movie_id
JOIN earning ON IMDB.movie_id = earning.movie_id
WHERE (earning.domestic + earning.worldwide) = (
    SELECT MAX(domestic + worldwide) FROM earning
)
"""

data = pd.read_sql_query(query, db)
data

   Rating
0     8.1
1     8.1
2     8.1

In [97]:
import pandas as pd
import sqlite3

# Assuming you have a SQLite database connection named 'db'
query = """
SELECT IMDB.rating
FROM IMDB
JOIN (
    SELECT movie_id, (domestic + worldwide) AS total_earnings
    FROM earning
    ORDER BY total_earnings DESC
    LIMIT 1
) AS highest_earning_movie ON IMDB.movie_id = highest_earning_movie.movie_id
JOIN genre ON IMDB.movie_id = genre.movie_id
"""

data = pd.read_sql_query(query, db)

In [98]:
data

   Rating
0     8.1
1     8.1
2     8.1